# Brewfile

# Taps
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "junegunn/tap"
tap "raine/workmux"
tap "satococoa/tap"

# Core system utilities
brew "coreutils"
brew "curl"
brew "findutils"
brew "gettext"
brew "gnu-sed"
brew "grep"
brew "moreutils"
brew "wget"

# Shell and prompt
brew "zsh"
brew "starship"

# Development tools
brew "git"
brew "git-delta"
brew "mise"
brew "neovim"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "scmpuff"
brew "stylua"

# Search and file tools
brew "ack"
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "junegunn/tap/blsd", args: ["HEAD"]
brew "ripgrep"
brew "the_silver_searcher"
brew "trash"

# Terminal and tmux
brew "tmux"
brew "reattach-to-user-namespace"
brew "tmuxinator"
brew "urlview"
brew "raine/workmux/workmux"
brew "satococoa/wtp/wtp"

# System monitoring
brew "btop"
brew "httpie"
brew "imageoptim-cli"
brew "yt-dlp"

# Window management
brew "koekeishiya/formulae/skhd"
cask "jordanbaird-ice"

# Image processing
brew "exiftool"
brew "imagemagick"
brew "webp"

# Additional utilities
brew "bc"
brew "gawk"
brew "gh"
brew "glab"
brew "jq"
brew "diff-so-fancy"
brew "nnn"
brew "source-highlight"

# Applications
cask "1password"
cask "alacritty"
cask "wezterm"
cask "contexts"
cask "cursorcerer"
cask "daisydisk"
cask "deskpad"
cask "firefox"
cask "firefox@developer-edition"
cask "google-chrome@beta"
cask "google-chrome@canary"
cask "google-drive"
cask "gpg-suite"
cask "iina"
cask "istat-menus"
cask "karabiner-elements"
cask "keepingyouawake"
cask "keyboardcleantool"
cask "meetingbar"
cask "middleclick"
cask "monitorcontrol"
cask "nikitabobko/tap/aerospace"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "shifty"
cask "spotify"
cask "vscodium"
cask "yaak"

# Fonts
cask "font-sauce-code-pro-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-noto-sans-symbols-2"
cask "font-commit-mono-nerd-font"
